_posts/2013-10-21-Enabling-right-clicks-in-org-mode-links.html
---
title: Enabling right-clicks in org-mode links
date: 2013/10/21 19:58:52
updated: 2013/10/21 20:45:37
categories: org-mode
tags: 
---


<p>
Out of the box you can click on org-mode links to make the do things. On my machine, all clicks are equal, left mouse, middle mouse, and right mouse all act as a "click". I was curious about whether I could get different behavior on a link with a left or right mouse click. It is easy enough to <a href="http://orgmode.org/manual/Adding-hyperlink-types.html">define a new link type</a> . You define a function that is run when you click on the link.
</p>

<p>
To figure out what to do here, I looked into the events handling in emacs. According to this <a href="http://www.gnu.org/software/emacs/manual/html_node/elisp/Click-Events.html">page</a> , there are click events. So, after we click on a link, there should be a click event which was the last input event. We can get that, figure out which button was pressed, and run code accordingly. We will make the code add some lines to the buffer after the link about what happened.
</p>

<p>
Here is my link definition. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq counter 1)
(org-add-link-type
 <span style="color: #228b22;">"test"</span>
 <span style="color: #ff0000; font-weight: bold;">;; </span><span style="color: #ff0000; font-weight: bold;">this function is run when you click</span>
 (<span style="color: #8b0000;">lambda</span> (link-string) 
   (<span style="color: #8b0000;">let</span> ((button (car last-input-event)))
     (<span style="color: #8b0000;">cond</span> ((eq button 'mouse-1) 
            (end-of-line)
            (insert (format <span style="color: #228b22;">"\nclick %s. mouse-1 pressed %s\n"</span> counter last-input-event))
            (setq counter (+ counter 1)))
           ((eq button 'mouse-2) 
            (end-of-line) 
            (insert (format <span style="color: #228b22;">"\nclick %s. mouse-2 pressed %s\n"</span> counter last-input-event))
            (setq counter (+ counter 1)))
           ((eq button 'mouse-3) 
            (end-of-line)
            (insert (format <span style="color: #228b22;">"\nclick %s. mouse-3 pressed %s\n"</span> counter last-input-event))
            (setq counter (+ counter 1))))))
 <span style="color: #ff0000; font-weight: bold;">;; </span><span style="color: #ff0000; font-weight: bold;">formatting</span>
(<span style="color: #8b0000;">lambda</span> (keyword desc format)
   (<span style="color: #8b0000;">cond</span>
    ((eq format 'html) (format <span style="color: #228b22;">"&lt;pre&gt;%s:%s&lt;/pre&gt;"</span> keyword desc)))))
</pre>
</div>


<p>
Here we make a link. When you click on it, it adds lines right after the link telling you what was clicked on. I left-clicked, middle-clicked and right-clicked. The right-clicked result is the first line.
</p>

<p>
<pre>test:which-button</pre> 
click 3. mouse-3 pressed (mouse-3 (#&lt;window 46 on blog.org&gt; 56959 (57 . 456) -320964819 nil 56959 (7 . 28) nil (1 . 8) (8 . 16)))
</p>

<p>
click 2. mouse-2 pressed (mouse-2 (#&lt;window 46 on blog.org&gt; 56959 (57 . 456) -320965724 nil 56959 (7 . 28) nil (1 . 8) (8 . 16)))
</p>

<p>
click 1. mouse-2 pressed (mouse-2 (#&lt;window 46 on blog.org&gt; 56959 (57 . 456) -320966660 nil 56959 (7 . 28) nil (1 . 8) (8 . 16)))
</p>


<p>
Curiously, this only shows that mouse-2 (for left or middle mouse) or mouse-3 (for right click) was pressed, never mouse-1. I am not sure what causes that. If I try to capture an event it does show mouse-1 is active.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(princ (read-event))
</pre>
</div>

<pre class="example">
(down-mouse-1 (#&lt;window 34 on blog.org&gt; 56437 (253 . 308) -322917920 nil 56437 (31 . 19) nil (93 . 4) (8 . 16)))
</pre>

<p>
Anyway, it looks conceivable that you could have different link actions occur for different mouse clicks. I could see using this in a citation link, where a left click might open the citation in my bibtex file, and right clicking would open a pdf of the citation if it existed. 
</p>

<p>
I have not figured out how flexible this might be, for example could you use modifier keys with mouse clicks? This code suggests that it is possible in emacs, but so far none of these make it into the last-input-event in the org-link clicks.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(princ (read-event))
</pre>
</div>

<pre class="example">
(S-down-mouse-1 (#&lt;window 34 on blog.org&gt; 56725 (1 . 299) -322897656 nil 56725 (0 . 18) nil (1 . 11) (8 . 16)))
</pre>

<p>
It might be difficult remembering all the modifiers and clicks, but it would be cool if it was possible!
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/10/21/Enabling-right-clicks-in-org-mode-links.org">org-mode source</a><p>